# EDA with Python

In [1]:
import pandas as pd

In [4]:
s1 = pd.Series([1,2,3,4,5])

In [6]:
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
type(s1)

pandas.core.series.Series

In [8]:
s1 = pd.Series([1,2,3,4,5], index = ['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
s2 = pd.Series({'a':1,'b':2,'c':3})

In [10]:
s2

a    1
b    2
c    3
dtype: int64

In [12]:
 s3 = pd.Series([2,35,23,6,8,3,7,8,9,35,56,24,27])
s3

0      2
1     35
2     23
3      6
4      8
5      3
6      7
7      8
8      9
9     35
10    56
11    24
12    27
dtype: int64

In [13]:
s3[2]

23

In [16]:
s3[-4:]

9     35
10    56
11    24
12    27
dtype: int64

In [17]:
s3[::-1]

12    27
11    24
10    56
9     35
8      9
7      8
6      7
5      3
4      8
3      6
2     23
1     35
0      2
dtype: int64

In [27]:
s4 = s1 + s2

In [28]:
s4

a    2.0
b    4.0
c    6.0
d    NaN
e    NaN
dtype: float64

In [30]:
df = pd.DataFrame({'Name':['Anshiii','Anshily','Anshika'],'Marks':[49,100,72]})

In [31]:
df

      Name  Marks
0  Anshiii     49
1  Anshily    100
2  Anshika     72

In [32]:
df.head(2)

      Name  Marks
0  Anshiii     49
1  Anshily    100

In [33]:
df.describe()

            Marks
count    3.000000
mean    73.666667
std     25.540817
min     49.000000
25%     60.500000
50%     72.000000
75%     86.000000
max    100.000000

In [4]:
df = pd.read_csv('iris_dataset.csv')

In [36]:
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica
146,6.3,2.5,5.0,1.9,Iris-virginica
147,6.5,3.0,5.2,2.0,Iris-virginica
148,6.2,3.4,5.4,2.3,Iris-virginica
149,5.9,3.0,5.1,1.8,Iris-virginica

In [37]:
df.head(5)

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa

In [38]:
df.tail()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
145,6.7,3.0,5.2,2.3,Iris-virginica
146,6.3,2.5,5.0,1.9,Iris-virginica
147,6.5,3.0,5.2,2.0,Iris-virginica
148,6.2,3.4,5.4,2.3,Iris-virginica
149,5.9,3.0,5.1,1.8,Iris-virginica

In [39]:
df.shape

(150, 5)

In [40]:
df.describe()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.054000,3.758667,1.198667
std,0.828066,0.433594,1.764420,0.763161
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [41]:
df.iloc[0:3,0:2]

   sepal length (cm)  sepal width (cm)
0                5.1               3.5
1                4.9               3.0
2                4.7               3.2

In [46]:
df.loc[0:3,"sepal length (cm)"]

0    5.1
1    4.9
2    4.7
3    4.6
Name: sepal length (cm), dtype: float64

In [47]:
df.drop("petal width (cm)",axis = 1)
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
0,5.1,3.5,1.4,0.2,Iris-setosa
1,4.9,3.0,1.4,0.2,Iris-setosa
2,4.7,3.2,1.3,0.2,Iris-setosa
3,4.6,3.1,1.5,0.2,Iris-setosa
4,5.0,3.6,1.4,0.2,Iris-setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica
146,6.3,2.5,5.0,1.9,Iris-virginica
147,6.5,3.0,5.2,2.0,Iris-virginica
148,6.2,3.4,5.4,2.3,Iris-virginica
149,5.9,3.0,5.1,1.8,Iris-virginica

In [49]:
df.drop([0,1,2,4,6], axis = 0, inplace = True)
df

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm),target
3,4.6,3.1,1.5,0.2,Iris-setosa
5,5.4,3.9,1.7,0.4,Iris-setosa
7,5.0,3.4,1.5,0.2,Iris-setosa
8,4.4,2.9,1.4,0.2,Iris-setosa
9,4.9,3.1,1.5,0.1,Iris-setosa
...,...,...,...,...,...
145,6.7,3.0,5.2,2.3,Iris-virginica
146,6.3,2.5,5.0,1.9,Iris-virginica
147,6.5,3.0,5.2,2.0,Iris-virginica
148,6.2,3.4,5.4,2.3,Iris-virginica
149,5.9,3.0,5.1,1.8,Iris-virginica

In [57]:
l = df.drop("petal width (cm)",axis = 1,)
l

     sepal length (cm)  sepal width (cm)  petal length (cm)
3                  4.6               3.1                1.5
5                  5.4               3.9                1.7
7                  5.0               3.4                1.5
8                  4.4               2.9                1.4
9                  4.9               3.1                1.5
..                 ...               ...                ...
145                6.7               3.0                5.2
146                6.3               2.5                5.0
147                6.5               3.0                5.2
148                6.2               3.4                5.4
149                5.9               3.0                5.1

[145 rows x 3 columns]

In [58]:
df.mean()

sepal length (cm)    5.877241
sepal width (cm)     3.044138
petal length (cm)    3.840690
petal width (cm)     1.232414
dtype: float64

In [61]:
df.min()

sepal length (cm)    4.3
sepal width (cm)     2.0
petal length (cm)    1.0
petal width (cm)     0.1
dtype: float64

In [60]:
df.max()

sepal length (cm)    7.9
sepal width (cm)     4.4
petal length (cm)    6.9
petal width (cm)     2.5
dtype: float64

In [62]:
df.median()

sepal length (cm)    5.8
sepal width (cm)     3.0
petal length (cm)    4.4
petal width (cm)     1.3
dtype: float64

In [63]:
def half(s):
    return s*0.5

In [64]:
df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
3                4.6               3.1                1.5               0.2
5                5.4               3.9                1.7               0.4
7                5.0               3.4                1.5               0.2
8                4.4               2.9                1.4               0.2
9                4.9               3.1                1.5               0.1

In [65]:
df[['sepal length (cm)']].apply(half)

     sepal length (cm)
3                 2.30
5                 2.70
7                 2.50
8                 2.20
9                 2.45
..                 ...
145               3.35
146               3.15
147               3.25
148               3.10
149               2.95

[145 rows x 1 columns]

In [5]:
def double_data(d):
    return d*2

In [6]:
df[['petal length (cm)']].apply(double_data)

     petal length (cm)
0                  2.8
1                  2.8
2                  2.6
3                  3.0
4                  2.8
..                 ...
145               10.4
146               10.0
147               10.4
148               10.8
149               10.2

[150 rows x 1 columns]